import 'package:app/app/core/utils/colors_manager.dart';
import 'package:app/app/core/utils/scroll_behavior.dart';
import 'package:app/app/modules/home/widgets/footer.dart';
import 'package:app/app/widgets/appbar/appbar.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:get/get.dart';

import '../controllers/terms_and_conditions_controller.dart';

class TermsAndConditionsView extends GetView<TermsAndConditionsController> {
  const TermsAndConditionsView({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const CustomAppBar(),
      body: ScrollConfiguration(
        behavior: CustomScrollBehavior(),
        child: ListView(
          padding: EdgeInsets.zero,
          children: [
            Padding(
              padding: EdgeInsets.symmetric(horizontal: 20.w, vertical: 35.h),
              child: Column(
                children: [
                  _section(
                      title: 'الشروط والأحكام',
                      content:
                          'تعتبر هذه الشروط والأحكام جزءًا لا يتجزأ من الاتفاق المبرم بين ناشر المشروع (العميل) والمقاول، حيث يلتزم المقاول بتنفيذ الأعمال موضوع العقد وفقًا للمخططات والمواصفات الفنية المعتمدة من قبل العميل وبما يتوافق مع القوانين والأنظمة السارية، ويتعهد المقاول باستخدام المواد المتفق عليها وضمان جودتها وتحمل مسؤولية أي عيوب أو مخالفات تظهر خلال فترة التنفيذ أو الضمان، كما يلتزم المقاول بالجدول الزمني المحدد لتسليم مراحل المشروع ويلتزم بدفع غرامة تأخير في حال تجاوز المدة الزمنية المحددة دون أسباب قاهرة معتمدة، ويلتزم العميل بدفع الدفعات المالية المستحقة للمقاول وفق مراحل الإنجاز المتفق عليها وعدم تأخيرها بما يضر بسير العمل، وفي حال نشوء أي نزاع بين الطرفين يتم حله وديًا قدر الإمكان، وفي حال تعذر ذلك يتم اللجوء إلى التحكيم أو المحكمة المختصة حسب ما ينص عليه العقد، ويقر الطرفان أن هذه الشروط والأحكام ملزمة وواجبة التنفيذ وتحفظ حقوقهما بما يضمن سير المشروع بشكل منظم وعادل.'),
                  Divider(),
                  _section(
                      title: 'سياسة الاستخدام',
                      content:
                          'تعتبر هذه الشروط والأحكام جزءًا لا يتجزأ من الاتفاق المبرم بين ناشر المشروع (العميل) والمقاول، حيث يلتزم المقاول بتنفيذ الأعمال موضوع العقد وفقًا للمخططات والمواصفات الفنية المعتمدة من قبل العميل وبما يتوافق مع القوانين والأنظمة السارية، ويتعهد المقاول باستخدام المواد المتفق عليها وضمان جودتها وتحمل مسؤولية أي عيوب أو مخالفات تظهر خلال فترة التنفيذ أو الضمان، كما يلتزم المقاول بالجدول الزمني المحدد لتسليم مراحل المشروع ويلتزم بدفع غرامة تأخير في حال تجاوز المدة الزمنية المحددة دون أسباب قاهرة معتمدة، ويلتزم العميل بدفع الدفعات المالية المستحقة للمقاول وفق مراحل الإنجاز المتفق عليها وعدم تأخيرها بما يضر بسير العمل، وفي حال نشوء أي نزاع بين الطرفين يتم حله وديًا قدر الإمكان، وفي حال تعذر ذلك يتم اللجوء إلى التحكيم أو المحكمة المختصة حسب ما ينص عليه العقد، ويقر الطرفان أن هذه الشروط والأحكام ملزمة وواجبة التنفيذ وتحفظ حقوقهما بما يضمن سير المشروع بشكل منظم وعادل.'),
                  Divider(),
                  _section(
                      title: 'سياسة الخصوصية',
                      content:
                          'تعتبر هذه الشروط والأحكام جزءًا لا يتجزأ من الاتفاق المبرم بين ناشر المشروع (العميل) والمقاول، حيث يلتزم المقاول بتنفيذ الأعمال موضوع العقد وفقًا للمخططات والمواصفات الفنية المعتمدة من قبل العميل وبما يتوافق مع القوانين والأنظمة السارية، ويتعهد المقاول باستخدام المواد المتفق عليها وضمان جودتها وتحمل مسؤولية أي عيوب أو مخالفات تظهر خلال فترة التنفيذ أو الضمان، كما يلتزم المقاول بالجدول الزمني المحدد لتسليم مراحل المشروع ويلتزم بدفع غرامة تأخير في حال تجاوز المدة الزمنية المحددة دون أسباب قاهرة معتمدة، ويلتزم العميل بدفع الدفعات المالية المستحقة للمقاول وفق مراحل الإنجاز المتفق عليها وعدم تأخيرها بما يضر بسير العمل، وفي حال نشوء أي نزاع بين الطرفين يتم حله وديًا قدر الإمكان، وفي حال تعذر ذلك يتم اللجوء إلى التحكيم أو المحكمة المختصة حسب ما ينص عليه العقد، ويقر الطرفان أن هذه الشروط والأحكام ملزمة وواجبة التنفيذ وتحفظ حقوقهما بما يضمن سير المشروع بشكل منظم وعادل.'),
                ],
              ),
            ),
            HomeFooter(),
          ],
        ),
      ),
    );
  }

  _section({required String title, required String content}) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
          title,
          style: Get.textTheme.titleMedium!.copyWith(
            fontWeight: FontWeight.w700,
          ),
        ),
        10.verticalSpace,
        Text(
          content,
          maxLines: null,
          overflow: TextOverflow.visible,
          style: Get.textTheme.bodyMedium!.copyWith(
            fontSize: 14.sp,
            color: AppColors.grey,
          ),
        ),
      ],
    );
  }
}
